{"format": "layers-model", "generatedBy": "keras v2.15.0", "convertedBy": "TensorFlow.js Converter v4.21.0", "modelTopology": {"keras_version": "2.15.0", "backend": "tensorflow", "model_config": {"class_name": "Functional", "config": {"name": "model_1", "trainable": true, "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 6], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_4"}, "name": "input_4", "inbound_nodes": []}, {"class_name": "Dense", "config": {"name": "dense_112", "trainable": true, "dtype": "float32", "units": 120, "activation": "gelu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "HeUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_112", "inbound_nodes": [[["input_4", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_113", "trainable": true, "dtype": "float32", "units": 120, "activation": "gelu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "HeUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_113", "inbound_nodes": [[["dense_112", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_114", "trainable": true, "dtype": "float32", "units": 120, "activation": "gelu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "HeUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_114", "inbound_nodes": [[["dense_113", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_115", "trainable": true, "dtype": "float32", "units": 120, "activation": "gelu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "HeUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_115", "inbound_nodes": [[["dense_114", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_116", "trainable": true, "dtype": "float32", "units": 120, "activation": "gelu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "HeUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_116", "inbound_nodes": [[["dense_115", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_117", "trainable": true, "dtype": "float32", "units": 120, "activation": "gelu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "HeUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_117", "inbound_nodes": [[["dense_116", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_118", "trainable": true, "dtype": "float32", "units": 120, "activation": "gelu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "HeUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_118", "inbound_nodes": [[["dense_117", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_119", "trainable": true, "dtype": "float32", "units": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "HeUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_119", "inbound_nodes": [[["dense_118", 0, 0, {}]]]}], "input_layers": [["input_4", 0, 0]], "output_layers": [["dense_119", 0, 0]]}}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "dense_112/kernel", "shape": [6, 120], "dtype": "float32"}, {"name": "dense_112/bias", "shape": [120], "dtype": "float32"}, {"name": "dense_113/kernel", "shape": [120, 120], "dtype": "float32"}, {"name": "dense_113/bias", "shape": [120], "dtype": "float32"}, {"name": "dense_114/kernel", "shape": [120, 120], "dtype": "float32"}, {"name": "dense_114/bias", "shape": [120], "dtype": "float32"}, {"name": "dense_115/kernel", "shape": [120, 120], "dtype": "float32"}, {"name": "dense_115/bias", "shape": [120], "dtype": "float32"}, {"name": "dense_116/kernel", "shape": [120, 120], "dtype": "float32"}, {"name": "dense_116/bias", "shape": [120], "dtype": "float32"}, {"name": "dense_117/kernel", "shape": [120, 120], "dtype": "float32"}, {"name": "dense_117/bias", "shape": [120], "dtype": "float32"}, {"name": "dense_118/kernel", "shape": [120, 120], "dtype": "float32"}, {"name": "dense_118/bias", "shape": [120], "dtype": "float32"}, {"name": "dense_119/kernel", "shape": [120, 1], "dtype": "float32"}, {"name": "dense_119/bias", "shape": [1], "dtype": "float32"}]}]}